app/controllers/blog_posts_controller.rb

SELECT * FROM `blog_posts` ORDER BY created_at DESC LIMIT 0, 10
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
---
  def index
    @title = "All blog posts"
    @blog_posts = BlogPost.paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC'

SELECT * FROM `blog_posts` WHERE (user_id = 11 AND conference_id = 1) ORDER BY created_at DESC LIMIT 0, 10
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT `comments`.* FROM `comments` WHERE (`comments`.blog_post_id IN (5,4)) ORDER BY created_at
---
  def your
    @blog_post = BlogPost.new
    @title = "Your blog posts"
    @blog_posts = BlogPost.paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC',
                  :conditions => ['user_id = ? AND conference_id = ?', current_user, active_conference], :include => :comments

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
---
  def show
    @blog_post = BlogPost.find(params[:id])

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 4)
---
  def edit
    @blog_post = BlogPost.find(params[:id])

INSERT INTO `blog_posts` (`created_at`, `title`, `body`, `updated_at`, `user_id`, `conference_id`) VALUES('2009-10-02 17:29:47', 'hello', '<p>blip blap blup</p>', '2009-10-02 17:29:47', 11, 1)
SELECT * FROM `blog_posts` WHERE (user_id = 11 AND conference_id = 1) ORDER BY created_at DESC LIMIT 0, 10
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
---
  def create
    @blog_post = BlogPost.new(params[:blog_post])
    if current_user
      logger.debug("USER :" + current_user.full_name)
      @blog_post.user = current_user
      @blog_post.conference = active_conference
    else
      redirect_to blog_posts_path
      return
    end
  #  return if !request.post?
    error = false
    logger.debug("BLOG POST CREATE")
    respond_to do |format|
      if !@blog_post.duplicate?
        if @blog_post.save
          flash[:notice] = 'Blog post was successfully created.'
          format.html { redirect_to your_blog_posts_path }
          format.xml  { head :created, :location => blog_post_path(@blog_post) }
        else
          error = true
        end
      else
        flash[:notice] = 'This blog post is a duplicate of a previous blog'
        error = true
      end
      if error
        @blog_posts = BlogPost.paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC',
                      :conditions => ['user_id = ? AND conference_id = ?', current_user, active_conference], :include => :comments

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
UPDATE `blog_posts` SET `body` = '<p>dfgdsf fhfdh</p>', `updated_at` = '2009-10-03 02:00:11' WHERE `id` = 1
---
  def update
    @blog_post = BlogPost.find(params[:id])

 #   return if !request.post?

    respond_to do |format|
      if @blog_post.update_attributes(params[:blog_post])

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
DELETE FROM `blog_posts` WHERE `id` = 1
---
  def destroy
    @blog_post = BlogPost.find(params[:id])
    @blog_post.destroy