app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT * FROM `pictures`

  def show
    @picture = Picture.find(params[:id])
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 1)

  def edit
    @picture = Picture.find(params[:id])
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 1)

  def create
    @picture = Picture.new(params[:picture])
    @picture.user = current_user
    respond_to do |format|
      if @picture.save
---
INSERT INTO `pictures` (`status`, `updated_at`, `title`, `pic_content_type`, `pic_updated_at`, `description`, `pic_file_name`, `pic_file_size`, `user_id`, `created_at`) VALUES(NULL, '2009-10-02 23:36:13', 'taiwan', 'image/jpeg', '2009-10-02 23:36:11', 'nice!', 'IMG_0627.JPG', 1125659, 1, '2009-10-02 23:36:13')

  def publish
    @picture = Picture.find(params[:id])
    if !is_admin?
      redirect_to(@picture)
      return
    end
    @picture.status = 'published'
    respond_to do |format|
      if @picture.save
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 1)
UPDATE `pictures` SET `status` = 'published', `updated_at` = '2009-10-02 23:52:06' WHERE `id` = 1