app/controllers/posters_controller.rb

SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `posters` ORDER BY updated_at DESC LIMIT 3
SELECT count(*) AS count_all FROM `posters` WHERE (`posters`.conference_id = 1)
SELECT * FROM `conferences` ORDER BY year DESC LIMIT 3
SELECT * FROM `users` ORDER BY created_at DESC LIMIT 3
---
    def index
      #@posters = Poster.find(:all)
      @posters = Poster.paginate :page => params[:page], :per_page => 15, :order => 'id DESC'
      @posters_all = Poster.all :unique, :conditions => ['posters.conference_id = ? AND posters.user_id = users.id',       @active_conference.id], :include => :user, :order => 'users.last_name ASC'

SELECT * FROM `posters` WHERE (`posters`.`user_id` = 1)
---
    def your
      @posters = Poster.find_all_by_user_id(current_user.id)