app/controllers/profile_controller.rb

  def show
    @hide_edit_links = true
    screen_name = params[:screen_name]
    @user = User.find_by_screen_name(screen_name)
---
SELECT * FROM `users` WHERE (`users`.`screen_name` = 'ThomasAlrik') LIMIT 1