app/controllers/registrations_controller.rb

SELECT * FROM `conferences` ORDER BY year DESC LIMIT 3
SELECT * FROM `registrations` WHERE (`registrations`.`user_id` IS NULL AND `registrations`.`conference_id` = 1) LIMIT 1
SELECT * FROM `users` ORDER BY created_at DESC LIMIT 3
---
  def index
    @attendees = Registration.paginate_all_by_conference_id(@active_conference.id,
                    :conditions => 'user_id IS NOT NULL',
                    :include => :user, :page => params[:page], :per_page => 14,
                    :order => 'users.last_name ASC')
     @attendees_all = Registration.all :conditions => ['registrations.conference_id = ? AND registrations.user_id = users.id',       @active_conference.id], :include => :user, :order => 'users.last_name ASC'