app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 11)
---
  def show
    @title = "Neurodag User Hub"
    @user = User.find(session[:user_id])

SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `users` ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `users`
---
  def index
     @title = "Neurodag Members"
     order = params[:order]
     logger.debug("ORDER #{order}")
     @users = User.paginate :all, :page => params[:page], :order => 'created_at DESC', :per_page => 10

SELECT * FROM `users` WHERE (`users`.`id` = 11)
SELECT * FROM `blog_posts` WHERE (user_id = 11 AND conference_id = 1) ORDER BY created_at DESC LIMIT 0, 10
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `users` ORDER BY created_at DESC LIMIT 3
SELECT `comments`.* FROM `comments` WHERE (`comments`.blog_post_id = 4) ORDER BY created_at
---
  def blog_of
    @user = User.find(params[:id])
    if @user
      @title = "Blog posts of #{@user.full_name}"
      @blog_posts = BlogPost.paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC',
                    :conditions => ['user_id = ? AND conference_id = ?', @user.id, active_conference], :include => :comments

SELECT * FROM `blog_posts` ORDER BY updated_at DESC LIMIT 3
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT DISTINCT `users`.id FROM `users` LEFT OUTER JOIN `blog_posts` ON blog_posts.user_id = users.id WHERE (users.id = blog_posts.user_id) ORDER BY blog_posts.updated_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `blog_posts` WHERE (`blog_posts`.user_id = 11)
---
  def blogs
     @title = "Blogs of "
     @blog_users = User.paginate :all, :page => params[:page], :order => 'blog_posts.updated_at DESC', :per_page => 10,
                   :conditions => ['users.id = blog_posts.user_id' ], :include => :blog_posts

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 37
---
  def delete_selected
    delete_user_ids = params[:del_user]
    logger.debug(delete_user_ids)
    if is_admin?
      delete_user_ids.each do |id|
         u = User.find(id)
         u.registrations.delete_all

INSERT INTO `users` (`occupation`, `phone_no`, `city`, `avatar_updated_at`, `updated_at`, `authorization_token`, `avatar_file_name`, `avatar_file_size`, `title`, `crypted_password`, `role`, `avatar_content_type`, `screen_name`, `first_name`, `last_name`, `email`, `created_at`, `middle_name`, `hide_contact_info`) VALUES('', '', '', NULL, '2009-10-03 00:35:20', NULL, NULL, NULL, '', 'RqSlvZS2kBI=\n', NULL, NULL, 'anders', 'sdfa', 'cfsdfgdfs', 'dfgdfg@sdfg.com', '2009-10-03 00:35:20', '', 0)
SELECT `users`.id FROM `users` WHERE (`users`.`screen_name` = BINARY 'anders') LIMIT 1
---
  def new
    flash[:notice] = nil
    @title = "Register"
    @user = User.new
    if param_posted?(:user)
      @user = User.new(params[:user])
      @user.screen_name = params[:user][:screen_name].downcase
      @user.save_with_captcha
      if @user.errors.empty?

SELECT `users`.id FROM `users` WHERE (`users`.`screen_name` = BINARY 'rune' AND `users`.id <> 1) LIMIT 1
---
  def login
    @title = "Log in to #{@@site_name}"
    @user = User.new
    if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif param_posted?(:user)
      # create virtual user using credentials received from login page
      @user = User.new(params[:user])
      # find real user matching screen name
      user = User.find_by_screen_name(@user.screen_name.downcase)

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `avatar_file_size` = 72606, `avatar_file_name` = 'preview25.jpg', `avatar_updated_at` = '2009-10-02 23:34:10', `avatar_content_type` = 'image/jpeg', `updated_at` = '2009-10-02 23:34:11' WHERE `id` = 1
---
  def update
    # return if !request.post?
    @user = User.find(params[:id])
    @user.screen_name = params[:user][:screen_name].downcase
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    logger.debug("USER EDIT")
    @title = "Edit basic info"
    @user = User.find(session[:user_id])